SunCity/src/Enums/ТипыСистемНалогообложенияККТ/ТипыСистемНалогообложенияККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСистемНалогообложенияККТ</name>
  <enumValues>
    <name>ОСН</name>
    <comment>Общая систем налогообложения</comment>
  </enumValues>
  <enumValues>
    <name>УСНДоход</name>
    <comment>Упрощенная доход</comment>
  </enumValues>
  <enumValues>
    <name>УСНДоходРасход</name>
    <comment>Упрощенная доход минус расход</comment>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
    <comment>Единый налог на вмененный доход</comment>
  </enumValues>
  <enumValues>
    <name>ЕСН</name>
    <comment>Единый сельскохозяйственный налог</comment>
  </enumValues>
  <enumValues>
    <name>Патент</name>
    <comment>Патентная система налогообложения</comment>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ДниНедели/ДниНедели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДниНедели</name>
  <enumValues>
    <name>Понедельник</name>
  </enumValues>
  <enumValues>
    <name>Вторник</name>
  </enumValues>
  <enumValues>
    <name>Среда</name>
  </enumValues>
  <enumValues>
    <name>Четверг</name>
  </enumValues>
  <enumValues>
    <name>Пятница</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ОсобенностиУчетаНоменклатуры/ОсобенностиУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОсобенностиУчетаНоменклатуры</name>
  <enumValues>
    <name>АлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>БезОсобенностейУчета</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>КиЗГИСМ</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ЛекарственныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ОбувнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>СоковаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольноеПиво</name>
  </enumValues>
  <enumValues>
    <name>МорепродуктыПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МясоПодконтрольноеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ИгрыИИгрушкиДляДетей</name>
  </enumValues>
  <enumValues>
    <name>РадиоэлектроннаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ТитановаяМеталлопродукция</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>РастительныеМасла</name>
  </enumValues>
  <enumValues>
    <name>ОптоволокноИОптоволоконнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияБезВЕТИС</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/CommonModules/ОбщегоНазначенияРМКРТКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Поясняющие_надписи_ПрограммныйИнтерфейс

// Позволяет переопределить текст подсказки настройки запрета продаж
//
// Параметры:
//  ТекстПодсказки - Строка - в этот параметр нужно записать результат.
//
Процедура ЗаполнитьТекстПодсказкиНастройкиЗапретовПродаж(ТекстПодсказки) Экспорт
	Возврат;
КонецПроцедуры

// Формирует коллекцию для дополнения сообщения об отсутствующих в программе данных гиперссылками
//
// Параметры:
//  ДанныеДополненияПредупреждения - Структура:
//		* ИмяСущности - Строка - имя отсутствующей сущности
//		* ДанныеДополнения - ФорматированнаяСтрока - данные с гиперссылкой на форму списка сущности.
//
Процедура ЗаполнитьДанныеДополненияПредупреждения(ДанныеДополненияПредупреждения) Экспорт

	Если ТипЗнч(ДанныеДополненияПредупреждения) = Тип("Структура") Тогда
		
		ДанныеДополненияПредупреждения.Вставить("Организации",
			Новый ФорматированнаяСтрока(НСтр("ru = 'Организации'"),,,,"e1cib/list/Справочник.Организации"));
		ДанныеДополненияПредупреждения.Вставить("ТорговыеОбъекты",
			Новый ФорматированнаяСтрока(НСтр("ru = 'Торговые объекты'"),,,,"e1cib/list/Справочник.Магазины"));
		ДанныеДополненияПредупреждения.Вставить("КассыККМ",
			Новый ФорматированнаяСтрока(НСтр("ru = 'Кассы ККМ'"),,,,"e1cib/list/Справочник.КассыККМ"));
			
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Объект - ДанныеФормыКоллекция - данные объекта формы рабочего места кассира.
//  ТекущаяСтрока - Структура - строка табличной части товаров для обработки.
//
Процедура РассчитатьСуммуНДС(Объект, ТекущаяСтрока) Экспорт
	
	СистемаНалогообложения = ТекущаяСтрока.СистемаНалогообложения;
	
	Если СистемаНалогообложения <> ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН") Тогда
		ТекущаяСтрока.СуммаНДС = 0;
	Иначе
		
		ЗначениеСтавкиНДС = СтавкаНДСЧислом(ТекущаяСтрока.СтавкаНДС);
		
		ТекущаяСтрока.СуммаНДС = ?(Объект.ЦенаВключаетНДС,
			ТекущаяСтрока.Сумма * ЗначениеСтавкиНДС / (ЗначениеСтавкиНДС + 1),
			ТекущаяСтрока.Сумма * ЗначениеСтавкиНДС);
	
	КонецЕсли;
	
КонецПроцедуры

// Определяет вид отображения параметров в настройках рабочего места кассира.
// Значение по умолчанию - "Флажок".
//
// Параметры:
//  ВидОтображения - ВидФлажка - вид отображения настроек.
//
Процедура ПереопределитьВидОтображенияНастроек(ВидОтображения) Экспорт
	ВидОтображения = ВидФлажка.Флажок;
КонецПроцедуры

// Определяет положения заголовка параметров в настройках рабочего места кассира.
// Значение по умолчанию - "Лево".
//
// Параметры:
//  ПоложениеЗаголовка - ПоложениеЗаголовкаЭлементаФормы - положение заголовка.
//
Процедура ПереопределитьПоложениеЗаголовкаНастроек(ПоложениеЗаголовка) Экспорт
	ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
КонецПроцедуры

// Заполняет текст ошибки, если не удалось определить доступные кассы при запуске РМК.
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения об ошибке определения кассы.
//
Процедура ЗаполнитьТекстОшибкиПриОпределенииКассы(ТекстСообщения) Экспорт
	Возврат;
КонецПроцедуры

// Заполняет текст ошибки, если не удалось определить настройки рабочего места кассира при запуске РМК.
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения при ошибке определения настройки РМК..
//
Процедура ЗаполнитьТекстОшибкиПриОпределенииНастройкиРМК(ТекстСообщения) Экспорт
	Возврат;
КонецПроцедуры

// Заполняет день недели по дате 
//
// Параметры:
//  ДеньНедели - Неопределено, ОпределяемыйТип.ДниНеделиРМК.
//  Дата - Дата - дата, по которой определяется значение дня.
//
Процедура ЗаполнитьДеньНеделиПеречислением(Результат, Дата) Экспорт

	НачалоЛитералаДняНедели = "Перечисление.ДниНедели.";
	ДополнениеЛитералаДняНедели = "ПустаяСсылка";
	
	Если ЗначениеЗаполнено(Дата) Тогда
	
		ДеньНеделиЧислом = ДеньНедели(Дата);
		
		Если ДеньНеделиЧислом = 1 Тогда
			ДополнениеЛитералаДняНедели = "Понедельник";
		ИначеЕсли ДеньНеделиЧислом = 2 Тогда
			ДополнениеЛитералаДняНедели = "Вторник";
		ИначеЕсли ДеньНеделиЧислом = 3 Тогда
			ДополнениеЛитералаДняНедели = "Среда";
		ИначеЕсли ДеньНеделиЧислом = 4 Тогда
			ДополнениеЛитералаДняНедели = "Четверг";
		ИначеЕсли ДеньНеделиЧислом = 5 Тогда
			ДополнениеЛитералаДняНедели = "Пятница";
		ИначеЕсли ДеньНеделиЧислом = 6 Тогда
			ДополнениеЛитералаДняНедели = "Суббота";
		ИначеЕсли ДеньНеделиЧислом = 7 Тогда
			ДополнениеЛитералаДняНедели = "Воскресенье";
		Иначе
			ДополнениеЛитералаДняНедели = "ПустаяСсылка";
		КонецЕсли;
	
	КонецЕсли;
	
	ПолноеИмяЛитерала = СтрШаблон("%1%2", НачалоЛитералаДняНедели, ДополнениеЛитералаДняНедели);
	Результат = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(ПолноеИмяЛитерала);
	
КонецПроцедуры

// Определяет имя основной таблицы для списка видов оплат в помощнике настройки кассового места
//
// Параметры:
//  ИмяТаблицы - Строка - имя основной таблицы видов оплат до переопределения.
//
Процедура ЗаполнитьИмяОсновнойТаблицыВидовОплат(ИмяТаблицы) Экспорт
	Возврат;
КонецПроцедуры

// Переопределяет заголовок для колонки "Вид номенклатуры" в регистре "Условия запретов продаж".
//
// Параметры:
//  Заголовок - Строка - заголовок колонки.
//
Процедура ЗаполнитьЗаголовокВидНоменклатуры(Заголовок) Экспорт
КонецПроцедуры

// Переопределяет заголовок для колонки "Особенность учета" в регистре "Условия запретов продаж".
//
// Параметры:
//  Заголовок - Строка - заголовок колонки.
//
Процедура ЗаполнитьЗаголовокОсобенностьУчета(Заголовок) Экспорт
КонецПроцедуры

// Определяет является ли переданное значение особенности учета пивной продукцией.
//
// Параметры:
//  ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК - особенность учета.
//  Результат - Булево - Истина, если особенность учета является пивной продукцией.
//
Процедура ОпределитьОсобенностьУчетаПивнаяПродукция(ОсобенностьУчета, Результат) Экспорт
	
	Если ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.Пиво") Тогда
		Результат = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Определяет необходимость выводить остаток в представлении
//
// Параметры:
//  ВыводитьОстатокВПредставлении - Булево - Значение видимости
//
Процедура ВыводитьОстатокВПредставлении(ВыводитьОстатокВПредставлении) Экспорт
	ВыводитьОстатокВПредставлении = Ложь;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает числовое значение ставки НДС по значению перечисления.
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
//  Число - ставка ндс.
//
Функция СтавкаНДСЧислом(СтавкаНДС)
	
	Если СтавкаНДС = Неопределено ИЛИ СтавкаНДС = "Без НДС" Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат ?(СтавкаНДС.Ставка = 0, 0, СтавкаНДС.Ставка / 100);
	
КонецФункции

#КонецОбласти
